{
  "activation_function": "gelu_new",
  "architectures": [
    "GPT2LMHeadModel"
  ],
  "attn_pdrop": 0.4,
  "embd_pdrop": 0.4,
  "gradient_checkpointing": false,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "model_type": "gpt2",
  "n_ctx": 1024,
  "n_embd": 768,
  "n_head": 12,
  "n_inner": null,
  "n_layer": 12,
  "n_positions": 1024,
  "output_past": true,
  "resid_pdrop": 0.4,
  "task_specific_params": {
    "text-generation": {
      "do_sample": true,
      "max_length": 500
    }
  },
  "tokenizer_class": "BertTokenizer",
  "vocab_size": 21128
}
